/**
  * Реализовать односвязный список, обладающим следующим функционалом:
  * - добавление элементов в конец списка;
  * - добавление элементов в начало списка;
  * - вывод элементов списка;
  * - получение количества элементов списка;
  * - вставление элемента на указанную позицию;
  * - удаление всех элементов;
  * - удаление первого элемента списка;
  * - удаление последнего элемента списка;
  * - удаление элемента на указанной позиции;
  * - удаление элементов в диапозоне между двумя указанными позициями.
  */

#include <iostream>

int main()
{
    return 0;
}
